Revit 2027 API
Ellipse.RadiusY Property
Returns the Y vector radius of the ellipse.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RadiusY { get; }
Public ReadOnly Property RadiusY As Double
	Get
public:
property double RadiusY {
	double get ();
}
member RadiusY : float with get
Property Value
Double
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace